# identity-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/identity/identity-api/infrastructure/workspaces/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/production-identity-api/runs/run-y9PqsCSxNh8Hta3g

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database_user.random_password.password: Refreshing state... [id=none]
module.aws_lambda.data.archive_file.default: Refreshing...
module.database_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/lambda-production-identity-api]
module.aws_lambda.data.aws_iam_policy_document.default: Refreshing...
module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=ow2c68dueb]
module.aws_lambda.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]
module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-identity-api-production]
module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-identity-api-production-20230426010203996900000001]
module.aws_lambda.data.archive_file.default: Refresh complete after 1s [id=7a714ac2462de21a3426d4b788dde3c448f22b9c]
module.database_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=production-cockroachdb-serverless-cluster-id]
module.database_user.cockroach_sql_user.default: Refreshing state... [id=967af2d8-7a89-4eeb-95f6-55e6e9c0470b:production-identity-api]
module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/api-gateway-production-identity-api]
module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=lambda-production-identity-api]
module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=11sfhzi]
module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=dki41rb]
module.database_user.cockroach_sql_user.default: Drift detected (delete)
╷
│ Warning: Cluster not found
│
│   with module.database_user.cockroach_sql_user.default,
│   on ../../../../../shared/infrastructure/modules/serverless_database_user/resources.tf line 14, in resource "cockroach_sql_user" "default":
│   14: resource "cockroach_sql_user" "default" {
│
│ SQL User's parent cluster with clusterID
│ 967af2d8-7a89-4eeb-95f6-55e6e9c0470b is not found. Removing from state.
╵

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.database_user.cockroach_sql_user.default has been deleted
  - resource "cockroach_sql_user" "default" {
        id         = "967af2d8-7a89-4eeb-95f6-55e6e9c0470b:production-identity-api"
      - name       = "production-identity-api" -> null
      - password   = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "lambda-production-identity-api"
        tags                           = {
            "domain"        = "identity"
            "environment"   = "production"
            "resource"      = "identity-api"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "production-identity"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "production-identity-api"
    }

  # module.database_user.cockroach_sql_user.default will be created
  + resource "cockroach_sql_user" "default" {
      + cluster_id = (sensitive value)
      + id         = (known after apply)
      + name       = "production-identity-api"
      + password   = (sensitive value)
    }

  # module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "c618b617-b8d5-4f6d-8b86-18d6ef5aa945" -> "c9c4316b-341c-436a-907a-a718c2869b27"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*